results/test1/file/b/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][100.0%][w=11.6MiB/s][w=2977 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1092: Sat Mar 16 18:55:19 2024
  write: IOPS=1604, BW=6418KiB/s (6572kB/s)(378MiB/60327msec); 0 zone resets
    slat (nsec): min=471, max=32212k, avg=85494.59, stdev=441039.45
    clat (nsec): min=571, max=993233k, avg=4705139.88, stdev=52350930.27
     lat (usec): min=21, max=993235, avg=4790.63, stdev=52348.74
    clat percentiles (nsec):
     |  1.00th=[      868],  5.00th=[     2864], 10.00th=[    18816],
     | 20.00th=[   220160], 30.00th=[   325632], 40.00th=[   436224],
     | 50.00th=[   552960], 60.00th=[   700416], 70.00th=[   913408],
     | 80.00th=[  1269760], 90.00th=[  2039808], 95.00th=[  3162112],
     | 99.00th=[ 21626880], 99.50th=[143654912], 99.90th=[868220928],
     | 99.95th=[884998144], 99.99th=[985661440]
   bw (  KiB/s): min=  384, max=18469, per=33.01%, avg=8392.02, stdev=4157.52, samples=91
   iops        : min=   96, max= 4617, avg=2097.91, stdev=1039.37, samples=91
  lat (nsec)   : 750=0.61%, 1000=0.67%
  lat (usec)   : 2=2.29%, 4=2.46%, 10=2.39%, 20=1.80%, 50=1.88%
  lat (usec)   : 100=1.69%, 250=9.38%, 500=22.72%, 750=16.62%, 1000=10.42%
  lat (msec)   : 2=16.80%, 4=6.59%, 10=2.02%, 20=0.57%, 50=0.47%
  lat (msec)   : 100=0.07%, 250=0.09%, 500=0.02%, 750=0.18%, 1000=0.26%
  cpu          : usr=1.93%, sys=33.61%, ctx=212828, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.3%, 4=55.2%, 8=38.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.5%, 8=4.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,96788,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1093: Sat Mar 16 18:55:19 2024
  write: IOPS=1600, BW=6402KiB/s (6556kB/s)(377MiB/60339msec); 0 zone resets
    slat (nsec): min=410, max=40673k, avg=80407.15, stdev=416906.93
    clat (nsec): min=551, max=993916k, avg=4739575.87, stdev=52425980.74
     lat (usec): min=20, max=993919, avg=4819.98, stdev=52424.00
    clat percentiles (nsec):
     |  1.00th=[      956],  5.00th=[     3280], 10.00th=[    28544],
     | 20.00th=[   226304], 30.00th=[   333824], 40.00th=[   440320],
     | 50.00th=[   552960], 60.00th=[   708608], 70.00th=[   921600],
     | 80.00th=[  1286144], 90.00th=[  2113536], 95.00th=[  3325952],
     | 99.00th=[ 21626880], 99.50th=[147849216], 99.90th=[876609536],
     | 99.95th=[893386752], 99.99th=[985661440]
   bw (  KiB/s): min=  224, max=19592, per=32.96%, avg=8379.56, stdev=4030.20, samples=91
   iops        : min=   56, max= 4898, avg=2094.81, stdev=1007.55, samples=91
  lat (nsec)   : 750=0.42%, 1000=0.68%
  lat (usec)   : 2=2.12%, 4=2.29%, 10=2.11%, 20=1.56%, 50=1.73%
  lat (usec)   : 100=2.26%, 250=9.45%, 500=22.91%, 750=16.80%, 1000=10.30%
  lat (msec)   : 2=16.56%, 4=6.99%, 10=2.21%, 20=0.57%, 50=0.45%
  lat (msec)   : 100=0.07%, 250=0.08%, 500=0.02%, 750=0.18%, 1000=0.26%
  cpu          : usr=1.95%, sys=33.55%, ctx=211059, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.0%, 4=53.8%, 8=40.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.9%, 8=4.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,96576,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1094: Sat Mar 16 18:55:19 2024
  write: IOPS=1543, BW=6175KiB/s (6323kB/s)(364MiB/60311msec); 0 zone resets
    slat (nsec): min=441, max=49218k, avg=101990.63, stdev=581393.29
    clat (nsec): min=541, max=988172k, avg=4834032.33, stdev=53276629.38
     lat (usec): min=18, max=988176, avg=4936.02, stdev=53275.91
    clat percentiles (nsec):
     |  1.00th=[      876],  5.00th=[     2896], 10.00th=[    18560],
     | 20.00th=[   220160], 30.00th=[   329728], 40.00th=[   440320],
     | 50.00th=[   552960], 60.00th=[   700416], 70.00th=[   905216],
     | 80.00th=[  1236992], 90.00th=[  2007040], 95.00th=[  3162112],
     | 99.00th=[ 20578304], 99.50th=[189792256], 99.90th=[876609536],
     | 99.95th=[901775360], 99.99th=[985661440]
   bw (  KiB/s): min=   31, max=16688, per=31.49%, avg=8006.22, stdev=3900.23, samples=92
   iops        : min=    7, max= 4172, avg=2001.43, stdev=975.02, samples=92
  lat (nsec)   : 750=0.63%, 1000=0.63%
  lat (usec)   : 2=2.16%, 4=2.73%, 10=2.37%, 20=1.71%, 50=2.03%
  lat (usec)   : 100=1.92%, 250=8.71%, 500=23.00%, 750=16.82%, 1000=10.61%
  lat (msec)   : 2=16.60%, 4=6.42%, 10=2.02%, 20=0.60%, 50=0.39%
  lat (msec)   : 100=0.07%, 250=0.10%, 500=0.03%, 750=0.19%, 1000=0.26%
  cpu          : usr=1.83%, sys=32.19%, ctx=202254, majf=0, minf=0
  IO depths    : 1=1.0%, 2=7.0%, 4=55.6%, 8=36.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=94.8%, 8=5.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,93109,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1095: Sat Mar 16 18:55:19 2024
  write: IOPS=1608, BW=6436KiB/s (6590kB/s)(379MiB/60320msec); 0 zone resets
    slat (nsec): min=521, max=75990k, avg=85915.86, stdev=622875.32
    clat (nsec): min=551, max=999591k, avg=4691806.41, stdev=52298384.83
     lat (usec): min=18, max=999595, avg=4777.72, stdev=52298.26
    clat percentiles (nsec):
     |  1.00th=[      972],  5.00th=[     2960], 10.00th=[    23424],
     | 20.00th=[   220160], 30.00th=[   325632], 40.00th=[   432128],
     | 50.00th=[   544768], 60.00th=[   692224], 70.00th=[   905216],
     | 80.00th=[  1253376], 90.00th=[  2007040], 95.00th=[  3096576],
     | 99.00th=[ 21626880], 99.50th=[137363456], 99.90th=[868220928],
     | 99.95th=[893386752], 99.99th=[985661440]
   bw (  KiB/s): min=  248, max=17824, per=33.13%, avg=8424.16, stdev=4067.56, samples=91
   iops        : min=   62, max= 4456, avg=2105.95, stdev=1016.86, samples=91
  lat (nsec)   : 750=0.43%, 1000=0.62%
  lat (usec)   : 2=2.39%, 4=2.43%, 10=2.10%, 20=1.61%, 50=1.77%
  lat (usec)   : 100=2.02%, 250=9.87%, 500=23.35%, 750=16.53%, 1000=10.02%
  lat (msec)   : 2=16.77%, 4=6.53%, 10=1.91%, 20=0.58%, 50=0.43%
  lat (msec)   : 100=0.08%, 250=0.09%, 500=0.02%, 750=0.18%, 1000=0.26%
  cpu          : usr=1.91%, sys=33.40%, ctx=212320, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.4%, 4=54.8%, 8=39.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.7%, 8=4.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,97052,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=24.8MiB/s (26.0MB/s), 6175KiB/s-6436KiB/s (6323kB/s-6590kB/s), io=1498MiB (1571MB), run=60311-60339msec