results/test1/file/b/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
Jobs: 4 (f=4): [w(4)][100.0%][w=3161KiB/s][w=6323 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 19:01:11 2024
  write: IOPS=1687, BW=844KiB/s (864kB/s)(49.4MiB/60015msec); 0 zone resets
    slat (nsec): min=430, max=45890k, avg=73532.98, stdev=472423.06
    clat (nsec): min=551, max=818468k, avg=4517440.46, stdev=47993930.86
     lat (usec): min=20, max=818487, avg=4590.97, stdev=47992.32
    clat percentiles (nsec):
     |  1.00th=[     1112],  5.00th=[     4704], 10.00th=[    37120],
     | 20.00th=[   224256], 30.00th=[   325632], 40.00th=[   423936],
     | 50.00th=[   528384], 60.00th=[   659456], 70.00th=[   847872],
     | 80.00th=[  1155072], 90.00th=[  1826816], 95.00th=[  2736128],
     | 99.00th=[ 17956864], 99.50th=[383778816], 99.90th=[725614592],
     | 99.95th=[734003200], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 2029, per=31.87%, avg=1031.32, stdev=503.56, samples=98
   iops        : min=    2, max= 4058, avg=2062.79, stdev=1007.10, samples=98
  lat (nsec)   : 750=0.38%, 1000=0.43%
  lat (usec)   : 2=1.67%, 4=2.24%, 10=2.18%, 20=1.66%, 50=1.83%
  lat (usec)   : 100=1.55%, 250=10.97%, 500=24.87%, 750=17.58%, 1000=10.36%
  lat (msec)   : 2=15.73%, 4=5.66%, 10=1.58%, 20=0.39%, 50=0.31%
  lat (msec)   : 100=0.04%, 250=0.02%, 500=0.12%, 750=0.42%, 1000=0.03%
  cpu          : usr=1.92%, sys=31.60%, ctx=206704, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.6%, 4=55.5%, 8=38.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.5%, 8=4.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,101253,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1100: Sat Mar 16 19:01:11 2024
  write: IOPS=1557, BW=779KiB/s (797kB/s)(45.6MiB/60015msec); 0 zone resets
    slat (nsec): min=341, max=49650k, avg=65163.71, stdev=356699.99
    clat (nsec): min=571, max=816790k, avg=4947268.16, stdev=49914230.83
     lat (usec): min=22, max=816795, avg=5012.43, stdev=49912.31
    clat percentiles (nsec):
     |  1.00th=[     1416],  5.00th=[     9280], 10.00th=[   207872],
     | 20.00th=[   309248], 30.00th=[   415744], 40.00th=[   497664],
     | 50.00th=[   610304], 60.00th=[   749568], 70.00th=[   962560],
     | 80.00th=[  1302528], 90.00th=[  2056192], 95.00th=[  3129344],
     | 99.00th=[ 20840448], 99.50th=[446693376], 99.90th=[725614592],
     | 99.95th=[742391808], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 1705, per=29.12%, avg=942.37, stdev=454.97, samples=99
   iops        : min=    2, max= 3410, avg=1884.88, stdev=909.93, samples=99
  lat (nsec)   : 750=0.18%, 1000=0.27%
  lat (usec)   : 2=1.33%, 4=1.70%, 10=1.65%, 20=1.31%, 50=1.45%
  lat (usec)   : 100=0.36%, 250=6.10%, 500=25.81%, 750=19.71%, 1000=11.66%
  lat (msec)   : 2=18.09%, 4=6.88%, 10=2.01%, 20=0.44%, 50=0.33%
  lat (msec)   : 100=0.05%, 250=0.03%, 500=0.13%, 750=0.45%, 1000=0.03%
  cpu          : usr=1.90%, sys=37.43%, ctx=198808, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.1%, 4=53.1%, 8=42.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.4%, 8=3.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,93453,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1101: Sat Mar 16 19:01:11 2024
  write: IOPS=1715, BW=858KiB/s (878kB/s)(50.3MiB/60015msec); 0 zone resets
    slat (nsec): min=381, max=39295k, avg=68200.40, stdev=332926.99
    clat (nsec): min=561, max=815615k, avg=4457252.23, stdev=47534821.86
     lat (usec): min=19, max=815933, avg=4525.45, stdev=47533.38
    clat percentiles (nsec):
     |  1.00th=[     1240],  5.00th=[     5984], 10.00th=[    64768],
     | 20.00th=[   234496], 30.00th=[   329728], 40.00th=[   428032],
     | 50.00th=[   528384], 60.00th=[   667648], 70.00th=[   856064],
     | 80.00th=[  1171456], 90.00th=[  1875968], 95.00th=[  2834432],
     | 99.00th=[ 16711680], 99.50th=[367001600], 99.90th=[725614592],
     | 99.95th=[734003200], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 1921, per=32.42%, avg=1049.70, stdev=494.33, samples=98
   iops        : min=    2, max= 3842, avg=2099.53, stdev=988.67, samples=98
  lat (nsec)   : 750=0.30%, 1000=0.38%
  lat (usec)   : 2=1.50%, 4=2.07%, 10=2.03%, 20=1.48%, 50=1.85%
  lat (usec)   : 100=1.52%, 250=10.79%, 500=25.69%, 750=17.34%, 1000=10.20%
  lat (msec)   : 2=15.82%, 4=6.07%, 10=1.67%, 20=0.39%, 50=0.28%
  lat (msec)   : 100=0.03%, 250=0.02%, 500=0.12%, 750=0.41%, 1000=0.03%
  cpu          : usr=1.97%, sys=32.18%, ctx=213456, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.6%, 4=54.2%, 8=39.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.6%, 8=4.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102954,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1102: Sat Mar 16 19:01:11 2024
  write: IOPS=1511, BW=756KiB/s (774kB/s)(44.3MiB/60027msec); 0 zone resets
    slat (nsec): min=421, max=34074k, avg=68802.30, stdev=315142.22
    clat (nsec): min=561, max=819043k, avg=5079823.24, stdev=50644453.90
     lat (usec): min=18, max=819058, avg=5148.63, stdev=50641.86
    clat percentiles (nsec):
     |  1.00th=[     1528],  5.00th=[    10304], 10.00th=[   207872],
     | 20.00th=[   313344], 30.00th=[   423936], 40.00th=[   509952],
     | 50.00th=[   634880], 60.00th=[   782336], 70.00th=[   995328],
     | 80.00th=[  1351680], 90.00th=[  2113536], 95.00th=[  3194880],
     | 99.00th=[ 21626880], 99.50th=[513802240], 99.90th=[725614592],
     | 99.95th=[742391808], 99.99th=[792723456]
   bw (  KiB/s): min=    2, max= 1705, per=29.15%, avg=943.60, stdev=423.68, samples=96
   iops        : min=    4, max= 3410, avg=1887.31, stdev=847.35, samples=96
  lat (nsec)   : 750=0.17%, 1000=0.29%
  lat (usec)   : 2=1.08%, 4=1.75%, 10=1.65%, 20=1.29%, 50=1.46%
  lat (usec)   : 100=0.32%, 250=6.50%, 500=24.35%, 750=19.28%, 1000=12.06%
  lat (msec)   : 2=18.90%, 4=7.39%, 10=2.06%, 20=0.40%, 50=0.37%
  lat (msec)   : 100=0.03%, 250=0.03%, 500=0.13%, 750=0.47%, 1000=0.04%
  cpu          : usr=1.82%, sys=36.30%, ctx=193236, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.0%, 4=53.2%, 8=41.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.0%, 8=4.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,90748,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=3235KiB/s (3313kB/s), 756KiB/s-858KiB/s (774kB/s-878kB/s), io=190MiB (199MB), run=60015-60027msec